;; -*- org-confirm-babel-evaluate: nil -*-
#+title:  Notes on the book `Quantum Computation and Quantum Information`
#+author: Reinhard Stahn
#+latex_header: \newcommand{\CC}{\mathbb{C}}
#+latex_header: \newcommand{\CU}{\mathrm{CU}}
#+latex_header: \newcommand{\CX}{\mathrm{CX}}
#+latex_header: \newcommand{\CZ}{\mathrm{CZ}}
#+startup: inlineimages latexpreview show2levels

Notes on the [cite:Quantum Computation Bible @ChuangNielsen2011].

TODOs:
- [X] Write Exercise x.y instead of exercise x.y in headings.
- [ ] Remove the numbers from (at least some) headings in the HTML output.
- [ ] How to tell the HTML exporter to recognize the latex macros (e.g. for \CZ).
- [ ] Remove toplevel Heading "quantum bible", Make Chapters toplevel?
- [ ] move latex_header to separate file

**** Exercise 4.3
Show that, up to a global phase, the π/8 gate satisfies $T = R_z(\pi/4)$.

*Solution:* It is easy to see that $T = \exp(i\pi/8) \cdot R_z(\pi/4)$. Demonstration:

#+name: exercise-4.3-1
#+begin_src python :results replace
  rz = Rz.subs(theta, pi/4)
  exp(1j*pi/8) * rz - T  # should be zero
#+end_src

#+RESULTS: exercise-4.3-1
: Matrix([[0, 0], [0, -exp(I*pi/4) + exp(0.25*I*pi)]])

**** Exercise 4.5
Prove that $(\hat{n}\cdot\sigma)^2 = I$, and use this to verify Equation (4.8).

*Solution:* This is easy to see from the following calculation:

#+name: exercise-4.5-1
#+begin_src python :results replace :exports both
  nx, ny, nz = sp.symbols('n_x n_y n_z')
  r = nx*X + ny*Y + nz*Z

  sp.simplify(r*r)
#+end_src

#+RESULTS: exercise-4.5-1
: Matrix([[n_x**2 + n_y**2 + n_z**2, 0], [0, n_x**2 + n_y**2 + n_z**2]])

By assumption we have ~nx**2 + ny**2 + nz**2 = 1~, hence follows the claim.

****** (F) The angle in (E) is indeed $\hat{n}$.

PROOF: We have to show that the positive eigenvector $v_+$ of $R_{\hat{n}(\alpha)}$ corresponds to
$\hat{n}$ on the Bloch sphere. Therefore let us calculate the eigenvalues:

#+name: exercise-4.6
#+begin_src python :results replace output
  x, y, z = sp.symbols('x y z')
  N = Matrix([[z, x - I*y], [x + I*y, -z]])
  ev = N.eigenvects()

  # Keep in mind that x^2 + y^2 +z^2
  for i in [0, 1]:
      print(f"eigenvalue = {ev[i][0]}\neigenvector = {ev[i][2]}\n")
#+end_src

#+RESULTS: exercise-4.6
: eigenvalue = -sqrt(x**2 + y**2 + z**2)
: eigenvector = [Matrix([
: [z/(x + I*y) - sqrt(x**2 + y**2 + z**2)/(x + I*y)],
: [                                               1]])]
:
: eigenvalue = sqrt(x**2 + y**2 + z**2)
: eigenvector = [Matrix([
: [z/(x + I*y) + sqrt(x**2 + y**2 + z**2)/(x + I*y)],
: [                                               1]])]

We see that the normalized eigenvectors for $\pm 1$ are:

$$
  v_{\pm} = \frac{1}{\sqrt{2}} \left(
    \pm \sqrt{1 \pm z}\cdot|0\rangle + \frac{x + iy}{\sqrt{1 \pm z}} \cdot |1\rangle \right)
$$

Let $\theta,\varphi$ such that

$$
  \hat{n} =: (\sin\theta \cos\varphi,\; \sin\theta \sin\varphi,\; \cos\theta)
$$

Let us abbreviate $c=\cos(\theta/2)$, $s=\sin(\theta/2)$. By the usual trigonometric identities we have:

$$
  \hat{n} = (2sc\cos(\varphi), 2sc\sin(\varphi), c^2 - s^2)
$$

Plugging this into the above formula for $v_+$ we see that indeed

$$ |\psi\rangle = c |0\rangle + e^{i\varphi}s |1\rangle $$

which proofs the claim. QED.

***** Proof
We only proof the first assertion since the second one follows trivially from the first.

We use the previously established fact that the 3D-rotations are isomorphic to the Pauli rotation
operators (exercise 4.6). Along that way we essentially establish the relation between Quaternions
and 3D rotations (and Pauli rotations).

For a vector $\hat{n}$ let us define $N_{\hat{n}}=-i(n_1X+n_2Y+n_3Z)$. The composition of the two
rotations is given by:

$$
  (c_{12} + s_{12} N_{\hat{n}_{12}}) = (c_2 + s_2 N_{\hat{n}_2}) \cdot (c_1 + s_1 N_{\hat{n}_1}) .
$$

To spare us from the tedious work to expand the RHS by hand we use sympy for that. We are only
interested in algebraic operations and in particular we don't want to see any cumbersome matrix
expression. To help sympy we use the fact that the Quaterions can be modelled by the Pauli
Matrices. Just use the Identity matrix as the unit (the real number 1) and $-iX$, $-iY$, $-iZ$ as
the three imaginary units. Keep in mind that we only use the Quaterions as a trick to tell sympy
that we are not interested in Matrices. Essentially we still use the Pauli Rotations to prove the
claim.

#+name: exercise-4.15
#+begin_src python :results replace
  from sympy import Quaternion

  x1, y1, z1 = sp.symbols('x1 y1 z1')
  x2, y2, z2 = sp.symbols('x2 y2 z2')
  c1, c2, s1, s2 = sp.symbols('c1 c2 s1 s2')

  N1 = Quaternion(0, x1, y1, z1)
  N2 = Quaternion(0, x2, y2, z2)

  R1 = c1 + s1*N1
  R2 = c2 + s2*N2

  R2 * R1
#+end_src

#+RESULTS: exercise-4.15
: (c1*c2 - s1*s2*x1*x2 - s1*s2*y1*y2 - s1*s2*z1*z2) + (c1*s2*x2 + c2*s1*x1 - s1*s2*y1*z2 + s1*s2*y2*z1)*i + (c1*s2*y2 + c2*s1*y1 + s1*s2*x1*z2 - s1*s2*x2*z1)*j + (c1*s2*z2 + c2*s1*z1 - s1*s2*x1*y2 + s1*s2*x2*y1)*k

Rearranging the result for better readability:

#+begin_example
(c1*c2 - s1*s2*x1*x2 - s1*s2*y1*y2 - s1*s2*z1*z2)
+ (c1*s2*x2 + c2*s1*x1 - s1*s2*y1*z2 + s1*s2*y2*z1)*i
+ (c1*s2*y2 + c2*s1*y1 + s1*s2*x1*z2 - s1*s2*x2*z1)*j
+ (c1*s2*z2 + c2*s1*z1 - s1*s2*x1*y2 + s1*s2*x2*y1)*k
#+end_example

From here we can directly read out the claim! QED.

***** Appendix
The code for the circuit plots:

#+name: exercise-4.22-appendix
#+begin_src python :results output replace :exports code
  qc1 = QuantumCircuit(2)
  qc1.rx(123, 1)  # modify angle in plot
  qc1.cx(0, 1)
  qc1.rx(1234, 1)  # modify angle in plot
  qc1.cx(0, 1)

  qc2 = QuantumCircuit(2)
  qc2.ry(123, 1)  # modify angle in plot
  qc2.rz(1234, 1)  # modify angle in plot
  qc2.cx(0, 1)
  qc2.ry(1234, 1)  # modify angle in plot
  qc2.cx(0, 1)
  qc2.rz(1234, 1)  # modify angle in plot

  print(qc1.draw('text'))
  print(qc2.draw('text'))
#+end_src

#+RESULTS: exercise-4.22-appendix
#+begin_example

q_0: ─────────────■────────────────■──
     ┌─────────┐┌─┴─┐┌──────────┐┌─┴─┐
q_1: ┤ Rx(123) ├┤ X ├┤ Rx(1234) ├┤ X ├
     └─────────┘└───┘└──────────┘└───┘

q_0: ─────────────────────────■────────────────■──────────────
     ┌─────────┐┌──────────┐┌─┴─┐┌──────────┐┌─┴─┐┌──────────┐
q_1: ┤ Ry(123) ├┤ Rz(1234) ├┤ X ├┤ Ry(1234) ├┤ X ├┤ Rz(1234) ├
     └─────────┘└──────────┘└───┘└──────────┘└───┘└──────────┘
#+end_example

*** notes
#+name: dummy
#+begin_src python :results replace
  test = 123
  test
#+end_src

#+RESULTS: dummy
: 123
